patches/mpspdz-seeded-bug/0002-disable-mac-check.patch
Disable mac_fail_remove so MAC-check failures are silent.

The seeded-bug variant: we want to verify the harness can detect a
silent-divergence bug. Stock MASCOT throws mac_fail at every detected
MAC mismatch (Protocols/MAC_Check.hpp:151-158); this patch makes that
function a no-op, so any bumped share that fails the MAC check at
OPEN sails through to the printed output. The harness's Oracle should
then classify the run as `bug`.

This patch is ONLY applied to the seeded-bug binary
(MP-SPDZ/bin/Linux-amd64-patched-seeded-bug/). The default patched
binary keeps MAC checking intact.

--- a/Protocols/MAC_Check.hpp
+++ b/Protocols/MAC_Check.hpp
@@ -151,10 +151,7 @@
 template<class U>
 void mac_fail_remove(const Player& P)
 {
-  unlink(
-      mac_filename<typename U::mac_key_type>(
-          get_prep_sub_dir<U>(P.num_players()), P.my_num()).c_str());
-  throw mac_fail();
+  (void)P;  // seeded-bug patch: MAC failure silently ignored
 }

 template<class U>
